#### First, a dataset without any missing value (for comparision purpose)

In [1]:
import pandas as pd
file1_path = 'E:/MyDownloads/14_Sample_Dataset.xlsx'
raw_data_1 = pd.read_excel(file1_path, header=None)

In [2]:
raw_data_1.shape

(7, 3)

In [3]:
raw_data_1.head(7)

       0       1               2
0   star  20.000            1000
1   moon  20.500        10000004
2  earth  30.200        10000004
3   moon  25.000    100000047987
4   moon  30.000    100000047987
5  earth  30.254  10000004798788
6   star   3.140   1000000479872

In [4]:
raw_data_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
0    7 non-null object
1    7 non-null float64
2    7 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 180.0+ bytes

In [5]:
print([type(elem) for elem in raw_data_1.iloc[0, :]])

[<class 'str'>, <class 'numpy.float64'>, <class 'numpy.int64'>]

In [6]:
raw_data_1.describe()

               1             2
count   7.000000  7.000000e+00
mean   22.727714  1.600004e+12
std     9.717777  3.721559e+12
min     3.140000  1.000000e+03
25%    20.250000  1.000000e+07
50%    25.000000  1.000000e+11
75%    30.100000  5.500003e+11
max    30.254000  1.000000e+13

In [7]:
raw_data_1.nunique()

0    3
1    7
2    5
dtype: int64

In [8]:
#### Now, a dataset with 3 missing values

In [9]:
import numpy as np # needed for np.int64

In [10]:
file2_path = 'E:/MyDownloads/14_Sample_Dataset_2.xlsx'
raw_data_2 = pd.read_excel(file2_path, header=None)

In [11]:
raw_data_2.shape

(7, 3)

In [12]:
raw_data_2.head(7)

# you can see in the output that column # 2 is read as float instead of int
# and remember that our various efforts of having it read as or converted to int failed!
#   - the reason we discovered was missing values somehow causing Pandas to read the int column as float
#   - mind that this may not always be the case though - it depends on various things in the complex logic of Pandas

       0      1             2
0   star  20.00  1.000000e+03
1   moon  20.50  1.000000e+07
2  earth  30.20  1.000000e+07
3   moon  25.00           NaN
4    NaN  30.00  1.000000e+11
5  earth    NaN  1.000000e+13
6   star   3.14  1.000000e+12

In [13]:
raw_data_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
0    6 non-null object
1    6 non-null float64
2    6 non-null float64
dtypes: float64(2), object(1)
memory usage: 180.0+ bytes

In [14]:
print([type(elem) for elem in raw_data_2.iloc[0, :]])

[<class 'str'>, <class 'numpy.float64'>, <class 'numpy.float64'>]

In [15]:
raw_data_2.describe()

               1             2
count   6.000000  6.000000e+00
mean   21.473333  1.850004e+12
std    10.005252  4.011858e+12
min     3.140000  1.000000e+03
25%    20.125000  1.000000e+07
50%    22.750000  5.000502e+10
75%    28.750000  7.750004e+11
max    30.200000  1.000000e+13

In [16]:
raw_data_2.nunique()

0    3
1    6
2    5
dtype: int64

In [17]:
raw_data_2.columns = ['heavenly_body', 'att1', 'att2']

# renaming the columns so it would be easier to work with them

In [18]:
raw_data_2.head(7)

  heavenly_body   att1          att2
0          star  20.00  1.000000e+03
1          moon  20.50  1.000000e+07
2         earth  30.20  1.000000e+07
3          moon  25.00           NaN
4           NaN  30.00  1.000000e+11
5         earth    NaN  1.000000e+13
6          star   3.14  1.000000e+12

#### Imputation Technique 1: using 'ffill' method

In [19]:
raw_data_2.heavenly_body = raw_data_2.heavenly_body.fillna(method='ffill')

#### Imputation Technique 2: using mean value

In [20]:
att1_mean = raw_data_2.att1.mean()
raw_data_2.att1 = raw_data_2.att1.fillna(value=att1_mean)

#### Imputation Technique 3: using 'bfill' method

In [21]:
raw_data_2.att2 = raw_data_2.att2.fillna(method='bfill')

In [22]:
raw_data_2.head(7)

  heavenly_body       att1          att2
0          star  20.000000  1.000000e+03
1          moon  20.500000  1.000000e+07
2         earth  30.200000  1.000000e+07
3          moon  25.000000  1.000000e+11
4          moon  30.000000  1.000000e+11
5         earth  21.473333  1.000000e+13
6          star   3.140000  1.000000e+12

In [23]:
raw_data_2.att2 = raw_data_2.att2.astype(np.int64) 

# now we can convert this column to its proper type - int, as there as no more missing values!

In [24]:
raw_data_2.head(7)

  heavenly_body       att1            att2
0          star  20.000000            1000
1          moon  20.500000        10000004
2         earth  30.200000        10000004
3          moon  25.000000    100000047987
4          moon  30.000000    100000047987
5         earth  21.473333  10000004798788
6          star   3.140000   1000000479872